In [13]:
import pandas as pd
import numpy as np

In [22]:
path = '../data/csv_source/nama_gelar.csv'
df = pd.read_csv(path)

In [23]:
df.drop(df[df['strata']=='Profesi'].index.tolist(), inplace=True)
df.drop(df[df['strata']=='S3'].index.tolist(), inplace=True)
df.drop(df[df['strata']=='Sp1'].index.tolist(), inplace=True)
df.drop(df[df['strata']=='Sp2'].index.tolist(), inplace=True)

In [25]:
df.to_csv(path, index=False)

In [10]:
df = df.drop("Unnamed: 0",axis=1)

In [11]:
df.to_csv(path, index=False)

In [3]:
contains = df[df['name'].str.contains("\(|\)", na=False)]
contains['name'] = contains['name'].str.replace(r' \(.*\)','')

In [4]:
indices = contains.index.tolist()

In [5]:
indices

In [98]:
import string
import random
abjad = string.ascii_uppercase
abb = random.choices(abjad, k=1)[0]

name = 'Lalu Erfandi Maula Yusnu, S.Kom'.upper()
is_gelar = True

name_list = name.split(" ")
name_len = len(name_list)
if is_gelar:
    middle_index = name_len // 2
    name_list.insert(middle_index, abb)
else:
    name_list.insert(name_len, abb)
    
' '.join(name_list)

'LALU ERFANDI K MAULA YUSNU, S.KOM'

In [117]:
for idx in indices:
    df.loc[idx, 'name'] = contains.loc[idx]['name']

In [121]:
new_indices = df[df['name'].str.contains("\(|\)", na=False)].index.tolist()

In [122]:
df.drop(indices, inplace=True)

In [125]:
df.to_csv(path)

In [109]:
df[df['name'].str.contains("\(|\)", na=False)]

,name,base_name,gender,source
2439,Heru Anggara (b),heru,male,kamusnama.com
11849,Lasmini (a),lasmi,female,kamusnama.com
11864,Lasmini (b),lasmi,female,kamusnama.com
14631,Engelina Ratu Marisa (papua),engel,female,kamusnama.com
18173,Uswatun Hasanah (a),uswa,female,kamusnama.com
...,...,...,...,...
54253,Dong-sun (korea) Erwin (inggris) Tyler (inggris),dong-sun (korea),male,maknaa.com
54299,Donata (italia),donata (italia),female,maknaa.com
54342,Carey (wales) Pinda (indonesia) Berta (jerman)...,carey (wales),female,maknaa.com
54391,Colbert (inggris),colbert (inggris),male,maknaa.com
54452,Cho-hee (korea) Jenna (inggris) Huberta (tutenik),cho-hee (korea),female,maknaa.com

In [77]:
indices = df[df['name'].str.contains("\(|\)", na=False)].index.tolist()

In [78]:
indices

[30096, 38394, 40848, 43427, 45844, 47949, 48230, 49240, 50328]

In [68]:
df.index[indices]

Int64Index([40848, 43427, 47949, 48230, 49240], dtype='int64')

In [65]:
indices

[40848, 43427, 47949, 48230, 49240]

In [69]:
df.drop(df.index[indices], inplace=True)

In [70]:
df

      name  base_name  gender         source
0      NaN       joan    male  kamusnama.com
1      NaN       joan    male  kamusnama.com
2      NaN       joan    male  kamusnama.com
3      NaN       joan    male  kamusnama.com
4      NaN       joan    male  kamusnama.com
...    ...        ...     ...            ...
54517  NaN    jayadi     male     maknaa.com
54518  NaN    charly     male     maknaa.com
54519  NaN   carenza   female     maknaa.com
54520  NaN    nazaha   female     maknaa.com
54521  NaN  chasidah   female     maknaa.com

[54517 rows x 4 columns]

In [ ]:
df